; domain
(define (domain TruckDom) 
(:requirements :typing)  

(:types location locatable - object
        truck package - locatable) 

(:predicates (at ?x - locatable ?l - location) 	     
             (in ?p - package ?t - truck) 	     
             (connected ?x ?y - location)
             (free ?t - truck)
 	     (delivered ?p - package ?l - location)
	     (at-destination ?p - package ?l - location)
)

(:action load
 :parameters (?p - package ?t - truck ?l - location)
 :precondition (and (at ?t ?l) (at ?p ?l) (free ?t))
 :effect (and (not (at ?p ?l)) (not (free ?t)) (in ?p ?t))
)

(:action unload
 :parameters (?p - package ?t - truck ?l - location)
 :precondition (and (at ?t ?l) (in ?p ?t))
 :effect (and (not (in ?p ?t)) (free ?t) (at ?p ?l))
 )

(:action drive
 :parameters (?t - truck ?from ?to - location)
 :precondition (and (at ?t ?from) (connected ?from ?to))
 :effect (and (not (at ?t ?from)) (at ?t ?to)))

(:action deliver
 :parameters (?p - package ?l - location )
 :precondition (and (at ?p ?l))
 :effect (and (not (at ?p ?l)) (delivered ?p ?l) (at-destination ?p ?l)))
)

; problem
(define (problem TruckProb)
(:domain TruckDom)
(:objects
	truck1 - truck
	package1 - package
	package2 - package
	package3 - package
	l1 - location
	l2 - location
	l3 - location)

(:init
	(at truck1 l3)
	(free truck1)
	(at package1 l2)
	(at package2 l2)
	(at package3 l2)
	(connected l1 l2)
	(connected l1 l3)
	(connected l2 l1)
	(connected l2 l3)
	(connected l3 l1)
	(connected l3 l2)
    )

(:goal (and 
	(delivered package1 l3)
	(at-destination package2 l1)
	(delivered package3 l1)))
)

; plan
1. (drive truck1 l3 l2)
   deleted: (at truck1 l3)
   added: (at truck1 l2)
   goals met: 0 of 3
2. (load package1 truck1 l2)
   deleted: (at package1 l2) (free truck1)
   added: (in package1 truck1)
   goals met: 0 of 3
3. (drive truck1 l2 l3)
   deleted: (at truck1 l2)
   added: (at truck1 l3)
   goals met: 0 of 3
4. (unload package1 truck1 l3)
   deleted: (in package1 truck1)
   added: (free truck1) (at package1 l3)
   goals met: 0 of 3
5. (deliver package1 l3)
   deleted: (at package1 l3)
   added: (delivered package1 l3) (at-destination package1 l3)
   goals met: 1 of 3
6. (drive truck1 l3 l2)
   deleted: (at truck1 l3)
   added: (at truck1 l2)
   goals met: 1 of 3
7. (load package2 truck1 l2)
   deleted: (at package2 l2) (free truck1)
   added: (in package2 truck1)
   goals met: 1 of 3
8. (drive truck1 l2 l1)
   deleted: (at truck1 l2)
   added: (at truck1 l1)
   goals met: 1 of 3
9. (unload package2 truck1 l1)
   deleted: (in package2 truck1)
   added: (free truck1) (at package2 l1)
   goals met: 1 of 3
10. (deliver package2 l1)
   deleted: (at package2 l1)
   added: (delivered package2 l1) (at-destination package2 l1)
   goals met: 2 of 3
11. (drive truck1 l1 l2)
   deleted: (at truck1 l1)
   added: (at truck1 l2)
   goals met: 2 of 3
12. (load package3 truck1 l2)
   deleted: (at package3 l2) (free truck1)
   added: (in package3 truck1)
   goals met: 2 of 3
13. (drive truck1 l2 l1)
   deleted: (at truck1 l2)
   added: (at truck1 l1)
   goals met: 2 of 3
14. (unload package3 truck1 l1)
   deleted: (in package3 truck1)
   added: (free truck1) (at package3 l1)
   goals met: 2 of 3
15. (deliver package3 l1)
   deleted: (at package3 l1)
   added: (delivered package3 l1) (at-destination package3 l1)
   goals met: 3 of 3
